<a href="https://colab.research.google.com/github/Dck126/Tugas_Machine_Learning/blob/main/Project_final.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###Preprocessing Data Test

In [ ]:
import pandas as pd

In [ ]:
df_test=pd.read_csv("test.csv")
df_test.head(10)

   Index   gender date_of_birth  ... asset_class_cd asset_code  portfolio_type
0      0     Male    1996-12-31  ...              S        1.0               I
1      1     Male    1988-01-03  ...            NaN        1.0               R
2      2     Male    1970-01-07  ...            NaN        1.0               I
3      3     Male    1995-01-01  ...            NaN        1.0               R
4      4   Female    1983-01-04  ...              S        1.0               I
5      5     Male    1979-01-05  ...            NaN        1.0               R
6      6     Male    1981-01-04  ...            NaN        1.0               R
7      7     Male    1986-01-03  ...            NaN        1.0               R
8      8   Female    1990-01-02  ...            NaN        1.0               I
9      9     Male    2002-12-30  ...              S        1.0               I

[10 rows x 20 columns]

In [ ]:
df_test.shape

(13567, 20)

In [ ]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13567 entries, 0 to 13566
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Index                 13567 non-null  int64
 1   gender                13567 non-null  object
 2   date_of_birth         13567 non-null  object
 3   workclass             13567 non-null  object
 4   education_level       13567 non-null  object
 5   education_num         13567 non-null  float64
 6   marital_status        13567 non-null  object
 7   occupation            13567 non-null  object
 8   relationship          13567 non-null  object
 9   capital_gain          13567 non-null  float64
 10  capital_loss          13567 non-null  float64
 11  hours_per_week        13567 non-null  float64
 12  address               13567 non-null  object
 13  email                 13567 non-null  object
 14  inquiry_purpose_code  13193 non-null  float64
 15  institute_type        13567 non-null  object
 16  account_type          13567 non-null  int64
 17  asset_class_cd        2845 non-null   object
 18  asset_code            13548 non-null  float64
 19  portfolio_type        13564 non-null  object
dtypes: float64(6), int64(2), object(12)
memory usage: 2.1+ MB

In [ ]:
#menghitung missing value pada atribut
df_test.isna().sum()

Index                       0
gender                      0
date_of_birth               0
workclass                   0
education_level             0
education_num               0
marital_status              0
occupation                  0
relationship                0
capital_gain                0
capital_loss                0
hours_per_week              0
address                     0
email                       0
inquiry_purpose_code      374
institute_type              0
account_type                0
asset_class_cd          10722
asset_code                 19
portfolio_type              3
dtype: int64

In [ ]:
df_test['inquiry_purpose_code'].fillna(df_test['inquiry_purpose_code'].median(), inplace=True)

In [ ]:
df_test['asset_code'].fillna(df_test['asset_code'].median(), inplace=True)

In [ ]:
# menghilangkan 917 baris yang memiliki missing value pada kolom inqury_purpose_code
# to_drop = df_test.loc[df_test.isnull()['inquiry_purpose_code']].index
# df_test.drop(to_drop, axis=0, inplace=True)

In [ ]:
# to_drop = df_test.loc[df_test.isnull()['asset_code']].index
# df_test.drop(to_drop, axis=0, inplace=True)

In [ ]:
# df_test.head()
# df_test.shape

In [ ]:
#Drop atribut yang tidak digunakan
df_test.drop(['Index','gender','date_of_birth','workclass','education_level','marital_status','occupation','relationship','address','email','institute_type','asset_class_cd','portfolio_type'], axis=1, inplace=True)
df_test.head()

   education_num  capital_gain  ...  account_type  asset_code
0           10.0           0.0  ...            47         1.0
1            9.0           0.0  ...             5         1.0
2           14.0           0.0  ...           189         1.0
3            9.0           0.0  ...             5         1.0
4            9.0           0.0  ...           189         1.0

[5 rows x 7 columns]

In [ ]:
df_test.describe()

       education_num  capital_gain  ...  account_type   asset_code
count   13567.000000  13567.000000  ...  13567.000000  13567.00000
mean       10.120882   1130.773863  ...     78.445566      1.06221
std         2.539497   7710.529584  ...    139.230454      0.69906
min         1.000000      0.000000  ...      5.000000      1.00000
25%         9.000000      0.000000  ...      5.000000      1.00000
50%        10.000000      0.000000  ...      5.000000      1.00000
75%        12.000000      0.000000  ...    173.000000      1.00000
max        16.000000  99999.000000  ...    999.000000     19.00000

[8 rows x 7 columns]

###Preprocessing Data Train

In [ ]:
df_train = pd.read_csv("train.csv")
df_train.head(10)

   Unnamed: 0   gender date_of_birth  ... asset_class_cd asset_code  portfolio_type
0           0   Female    1950-01-12  ...            NaN        1.0               R
1           1     Male    1965-01-08  ...              S        1.0               I
2           2   Female    1997-12-31  ...            NaN        1.0               I
3           3     Male    1963-01-09  ...            NaN        1.0               R
4           4   Female    1996-01-01  ...            NaN        1.0               R
5           5     Male    1952-01-12  ...              S        1.0               I
6           6     Male    1953-01-11  ...            NaN        1.0               R
7           7   Female    1996-12-31  ...            NaN        1.0               R
8           8   Female    1993-01-01  ...            NaN        1.0               R
9           9   Female    1992-01-02  ...            NaN        1.0               R

[10 rows x 21 columns]

In [ ]:
df_train.shape

(31655, 21)

In [ ]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31655 entries, 0 to 31654
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            31655 non-null  int64
 1   gender                31655 non-null  object
 2   date_of_birth         31655 non-null  object
 3   workclass             31655 non-null  object
 4   education_level       31655 non-null  object
 5   education_num         31655 non-null  float64
 6   marital_status        31655 non-null  object
 7   occupation            31655 non-null  object
 8   relationship          31655 non-null  object
 9   capital_gain          31655 non-null  float64
 10  capital_loss          31655 non-null  float64
 11  hours_per_week        31655 non-null  float64
 12  approved              31655 non-null  int64
 13  address               31655 non-null  object
 14  email                 31655 non-null  object
 15  inquiry_purpose_code  30738 non-null  float64
 16  institute_type        31655 non-null  object
 17  account_type          31655 non-null  int64
 18  asset_class_cd        6647 non-null   object
 19  asset_code            31592 non-null  float64
 20  portfolio_type        31652 non-null  object
dtypes: float64(6), int64(3), object(12)
memory usage: 5.1+ MB

In [ ]:
df_train.isna().sum()

Unnamed: 0                  0
gender                      0
date_of_birth               0
workclass                   0
education_level             0
education_num               0
marital_status              0
occupation                  0
relationship                0
capital_gain                0
capital_loss                0
hours_per_week              0
approved                    0
address                     0
email                       0
inquiry_purpose_code      917
institute_type              0
account_type                0
asset_class_cd          25008
asset_code                 63
portfolio_type              3
dtype: int64

In [ ]:
df_train['inquiry_purpose_code'].fillna(df_train['inquiry_purpose_code'].median(), inplace=True)

In [ ]:
df_train['asset_code'].fillna(df_train['asset_code'].median(), inplace=True)

In [ ]:
# menghilangkan 917 baris yang memiliki missing value pada kolom inqury_purpose_code
# to_drop = df_train.loc[df_train.isnull()['inquiry_purpose_code']].index
# df_train.drop(to_drop, axis=0, inplace=True)

In [ ]:
# to_drop = df_train.loc[df_train.isnull()['asset_code']].index
# df_train.drop(to_drop, axis=0, inplace=True)

In [ ]:
# df_train.head()
# df_train.shape

In [ ]:
#Drop atribut yang tidak digunakan
df_train.drop(['Unnamed: 0','gender','date_of_birth','workclass','education_level','marital_status','occupation','relationship','address','email','institute_type','asset_class_cd','portfolio_type'], axis=1, inplace=True)
df_train.head()

   education_num  capital_gain  ...  account_type  asset_code
0            9.0           0.0  ...             5         1.0
1           11.0           0.0  ...            47         1.0
2           11.0           0.0  ...           189         1.0
3           10.0        6849.0  ...             5         1.0
4           13.0           0.0  ...             5         1.0

[5 rows x 8 columns]

In [ ]:
df_test.describe()

       education_num  capital_gain  ...  account_type   asset_code
count   13567.000000  13567.000000  ...  13567.000000  13567.00000
mean       10.120882   1130.773863  ...     78.445566      1.06221
std         2.539497   7710.529584  ...    139.230454      0.69906
min         1.000000      0.000000  ...      5.000000      1.00000
25%         9.000000      0.000000  ...      5.000000      1.00000
50%        10.000000      0.000000  ...      5.000000      1.00000
75%        12.000000      0.000000  ...    173.000000      1.00000
max        16.000000  99999.000000  ...    999.000000     19.00000

[8 rows x 7 columns]

In [ ]:
import sklearn
# from sklearn.tree import DecisionTreeRegressor
from sklearn.tree import DecisionTreeClassifier

In [ ]:
#factors that will predict the price
desired_factors = ['education_num','capital_gain','capital_loss','hours_per_week','inquiry_purpose_code','account_type','asset_code']

#set my model to DecisionTree
model = DecisionTreeClassifier()




#set prediction data to factors that will predict, and set target to SalePrice
# train_data = df_train[desired_factors]
# test_data = df_test[desired_factors]
# target = df_train.approved

In [ ]:
X = df_train.drop("approved", axis=1)
y = df_train.approved
column_names = X.columns

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn import metrics 
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=1)

In [ ]:
#fitting model with prediction data and telling it my target
model.fit(X_train, y_train)

y_pred = model.predict(X_test)

In [ ]:
print("Accuracy:",metrics.accuracy_score(y_test, y_pred))

Accuracy: 0.8160471727914078

In [ ]:
target =model.predict(test_data)

In [ ]:
print(target)

[0 0 1 ... 0 0 0]

In [ ]:
import csv
result =pd.DataFrame({'index':test_data.index,"approved":target})
result.to_csv("Submission.csv",index=False)